package Day04;

public class Inheritance {

    /*
        상속(Inheritance)
         : Java에서 상속은 자식클래스가 부모클래스의 [필드], [생성자], [메소드]를 물려받아 사용하는 것
         : 부모가 자식에게 물려주는 것이 상속의 개념이나 Java에서 상속은 자식이 부모의 것을 물려 받는다.

        extends
         : class가 class를 상속받을때 사용
         : interface가 interface를 상속받을때 사용
         : 부모에서 선언/정의를 모두 하고, 자식은 필드나 메소드를 그대로 사용할 수 있다.

        implements(interface구현)
         : 부모는 선언만 한다 (필드에 값을 부여하지 않고, 메소드에 내용을 작성하지 않는다)
         : 자식을 오버라이딩(재정의)를 통해 사용해야 한다.

        ※ 오버라이딩 vs 오버로딩 차이점!
         - 오버라이딩(overriding)
          : 부모클래스가 가지고 있는 필드, 메소드를 자식클래스가 다시 재정의해서 사용하는 기술
         - 오버로딩(overloading)
          : 같은 이름의 메소드를 여러개 가지면서 매개변수 유형과 갯수를 다르게 하는 기술
     */





}
